#абстракция - четкие коцептальные границы,
#инкапсуляция - члены обьектов могут быть скрыты от пользователя , которые нужны для реализцации
#наследование - класс наследники получают все поведение и свойства получают от наследуемого
#

# инкапсуляция - это свойство системы , позволяющее обьединить данные и методы, работающие с ними, в 
#классе, и скрыть детали реализации.  

# В пайтон все -  есть обьекты.
# любой тип данных есть классы.
# а все классы являються обектами экземпярами мета классов
#  Главный класс - Туре
# члены класса - атрибуты
#
#
#
#
#
#
#